{"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "A1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 108], "dtype": "float32", "sparse": false, "name": "A1"}, "inbound_nodes": []}, {"name": "A2", "class_name": "Dense", "config": {"name": "A2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["A1", 0, 0, {}]]]}, {"name": "A3", "class_name": "Dense", "config": {"name": "A3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["A2", 0, 0, {}]]]}, {"name": "add_45", "class_name": "Add", "config": {"name": "add_45", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["A2", 0, 0, {}], ["A3", 0, 0, {}]]]}, {"name": "A4", "class_name": "Dense", "config": {"name": "A4", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_45", 0, 0, {}]]]}, {"name": "add_46", "class_name": "Add", "config": {"name": "add_46", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["A2", 0, 0, {}], ["A3", 0, 0, {}], ["A4", 0, 0, {}]]]}, {"name": "A5", "class_name": "Dense", "config": {"name": "A5", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_46", 0, 0, {}]]]}], "input_layers": [["A1", 0, 0]], "output_layers": [["A5", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}